// Задача 29: Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.

int [] array = new int[] {1,2,3,4,5,6,7,8};
Console.WriteLine(array[0]);
Console.WriteLine(array[1]);
Console.WriteLine(array[2]);
Console.WriteLine(array[3]);
Console.WriteLine(array[4]);
Console.WriteLine(array[5]);
Console.WriteLine(array[6]);
Console.WriteLine(array[7]);
 
